tobi/app/views/management/valorizations/_table.haml

SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 ORDER BY `budgets`.`id` ASC LIMIT 1
---
-budget = Budget.where(:id => @valorization.budget_id).first

SELECT `valorizationitems`.* FROM `valorizationitems` WHERE `valorizationitems`.`valorization_id` = 3
---
            -total = 0
            - val=Valorizationitem.where(:valorization_id => @valorization.id)