tobi/app/views/management/valorizations/newvalorization.html.haml

SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`cost_center_id` = 2
---

  - all_budgets = Budget.where(:cost_center_id => @budget.cost_center_id)

SELECT COUNT(*) FROM `valorizations` WHERE `valorizations`.`budget_id` = 1
---
  - all_budgets.each do |ab|
    - num_val = num_val + Valorization.where(:budget_id => ab.id).count