tobi/app/views/management/wbsitems/add_items_to_wbs.haml

SELECT `budgets`.* FROM `budgets` WHERE (cost_center_id = '2' AND type_of_budget = '1')
---
        %option{:value => budget.id}
          = "--" * budget.cod_budget.length