tobi/app/views/management/wbsitems/showperitem_gantt.html.haml

SELECT `itembywbses`.* FROM `itembywbses` WHERE `itembywbses`.`wbsitem_id` = 1
---

                - item_master.itembywbses.each do |item|

SELECT MIN(`wbsitems`.`start_date`) AS min_id FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (start_date IS NOT NULL)
SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (start_date IS NOT NULL) ORDER BY `start_date` ASC, `wbsitems`.codewbs ASC LIMIT 1
SELECT MAX(`wbsitems`.`end_date`) AS max_id FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (end_date IS NOT NULL)
---

                  - start_day = Wbsitem.where("codewbs = ? ", item.wbscode ).first.start_date
                  - end_day = Wbsitem.where("codewbs = ? ", item.wbscode ).first.end_date