tobi/app/views/management/wbsitems/showbymonth_gantt.html.haml

                - amount
                - start_day = Wbsitem.where("codewbs = ? ", item.codewbs ).first.start_date
                - end_day = Wbsitem.where("codewbs = ? ", item.codewbs ).first.end_date
---
SELECT MIN(`wbsitems`.`start_date`) AS min_id FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (start_date IS NOT NULL)
SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (start_date IS NOT NULL) ORDER BY `start_date` ASC, `wbsitems`.codewbs ASC LIMIT 1
SELECT MAX(`wbsitems`.`end_date`) AS max_id FROM `wbsitems` WHERE (codewbs LIKE '2%') AND (end_date IS NOT NULL)