sigo/app/views/logistics/delivery_orders/_delivery_order_items.haml

          %optgroup{:label => "#{sector.name}"}
            -Sector.getSubSectors(sector.code).each do |subsector|
---
SELECT `sectors`.* FROM `sectors`

          %optgroup{:label => "#{phase.name}"}
            - Phase.get_subphases(phase.code).each do |subphase|
---
SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')