sigo/app/views/logistics/delivery_orders/_form.haml

SELECT `delivery_order_details`.* FROM `delivery_order_details` WHERE `delivery_order_details`.`delivery_order_id` = 2
---
                    - if @action != nil && @action == 'edit'
                      - @deliveryOrder.delivery_order_details.each do |dod|

SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')
---
                                %optgroup{:label => "#{phas.name}"}
                                  - Phase.get_subphases(phas.code).each do |subphase|

SELECT `articles`.* FROM `articles`
---

  $(document).ready(function(){
    $("#company_id").val("#{@company}");

    $('#article-select').select2({
      placeholder: "Buscar Insumos...",
      minimumInputLength: 3,
      ajax: {
        url: "#{display_articles_logistics_delivery_orders_path}",
        dataType: 'json',
        type: 'POST',
        quietMillis: 100,
        data: function(term, page){
          return {
            q: term,
            page: page,
            authenticity_token: "#{form_authenticity_token}"
          };
        },
        results: function(data, page){
          return {results: data.articles};
        }