sigo/app/views/logistics/delivery_orders/_form.haml

SELECT `sectors`.* FROM `sectors`
---
                              %optgroup{:label => "#{sector.name}"}
                                -Sector.getSubSectors(sector.code, @deliveryOrder.cost_center_id).each do |subsector|