sigo/app/views/logistics/delivery_orders/show.html.haml

                    %td
                      = @deliveryOrder.user.first_name + ' ' + @deliveryOrder.user.last_name
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1