sigo/app/views/logistics/categories/_table.html.haml

SELECT `categories`.* FROM `categories`
SELECT `subcategories`.* FROM `subcategories` WHERE `subcategories`.`category_id` = 1
---
            %ul
              -  Category.get_subcategories(@category.code).each do |subcategory|