app/controllers/logistics/subcategories_controller.rb

  def new
    @SubCategories = Subcategory.new
    @Categories = Category.all
---
SELECT `categories`.* FROM `categories`

  def create
    subcategory = Subcategory.new(subcategory_parameters)
    if subcategory.save
---
INSERT INTO `subcategories` (`category_id`, `code`, `created_at`, `name`, `updated_at`) VALUES (2, '0202', '2014-03-11 16:32:10', 'SubGrupo 2.1', '2014-03-11 16:32:10')

  def get_subcategory_form_category
    @subcategories = Subcategory.where("category_id = ?", params[:category_id])
---
SELECT `subcategories`.* FROM `subcategories` WHERE (category_id = '1')