sigo/app/views/logistics/phases/_table.haml

                %ul
                  - Phase.get_subphases(phase.code).each do |subphase|
---
SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')