tobi/app/controllers/administration/advances_controller.rb

	def index
		@advances = Advance.where(:cost_center_id => params[:project_id])
---
SELECT `advances`.* FROM `advances` WHERE `advances`.`cost_center_id` IS NULL

	def create
		@advance = Advance.new(advances_parameters)
		@advance.cost_center_id = params[:project_id]
		@advance.save
---
INSERT INTO `advances` (`advance_direct_cost_percent`, `advance_number`, `advance_type`, `amount`, `cost_center_id`, `created_at`, `updated_at`) VALUES (5.0, 123, 'Algun tipo', 100.0, 2, '2014-06-05 21:52:05', '2014-06-05 21:52:05')