tobi/app/controllers/administration/charges_controller.rb

	def index
		@charges = Charge.where(:invoice_id => params[:invoice_id])
---
SELECT `charges`.* FROM `charges` WHERE `charges`.`invoice_id` IS NULL

	def new
		@invoices = Invoice.find(params[:invoice_id])
---
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 1 LIMIT 1

	def create
		@charge = Charge.new(charge_parameters)
		@charge.save

		@invoices = Invoice.find(params[:invoice_id])
		sum = @invoices.charges.sum('payment_amount')
		if sum >= @invoices.amount
			@invoices.paid
		end
		@invoices.observations = sum
		@invoices.save
---
INSERT INTO `charges` (`amount`, `charge_date`, `created_at`, `financial_agent_client`, `financial_agent_destiny`, `invoice_id`, `payment_amount`, `updated_at`) VALUES (100.0, '2014-06-06', '2014-06-06 17:42:38', 'algun cliente', 'algun destino', 1, 100.0, '2014-06-06 17:42:38')
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 1 LIMIT 1
SELECT SUM(`charges`.`payment_amount`) AS sum_id FROM `charges` WHERE `charges`.`invoice_id` = 1
UPDATE `invoices` SET `observations` = 100.0, `updated_at` = '2014-06-06 17:42:38' WHERE `invoices`.`id` = 1