tobi/app/controllers/administration/inputcategories_controller.rb

	def feo_of_work
		project_id =  params[:project_id]

		@budget_sale = Budget.find(params[:budget_sale]) rescue Budget.where(:cost_center_id => project_id).last
		@budget_goal = Budget.find(params[:budget_goal]) rescue @budget_sale #Budget.where(:cost_center_id).last

		p '~~~~~~~~~~~~~~~~~~~~~~~~@budget_sale~~~~~~~~~~~~~~~~~~~~~~~'
		p @budget_sale.id

		@wbsitems = Wbsitem.where(cost_center_id: project_id).order(:codewbs)
		@inputcategories = Inputcategory.all
---
SELECT `budgets`.* FROM `budgets` WHERE ('cost_center_id') ORDER BY `budgets`.`id` DESC LIMIT 1
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 0 LIMIT 1
SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`cost_center_id` = 2 ORDER BY `wbsitems`.codewbs ASC
SELECT `inputcategories`.* FROM `inputcategories`