tobi/app/controllers/administration/invoices_controller.rb

	def index
		@budget_id = params[:budget_id]
		@budget = Budget.find(@budget_id)
---
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1

	def new
		@valorization = Valorization.find(params[:valorization_id])
---
SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 ORDER BY `valorizations`.`id` ASC LIMIT 1

	def create
		@invoice = Invoice.new(invoice_parameters)
		@invoice.status
		@budget_id = params[:budget_id]
		@invoice.save
---
INSERT INTO `invoices` (`amount`, `created_at`, `credit_note`, `document_number`, `filing_date`, `issue_date`, `observations`, `status`, `updated_at`, `valorization_id`) VALUES (100.0, '2014-06-05 20:27:38', '0', '11', '2014-06-05', '2014-06-05', '', 'pending', '2014-06-05 20:27:38', 1)

	def edit
		@invoice = Invoice.find(params[:id])
---
SELECT `invoices`.* FROM `invoices` WHERE `invoices`.`id` = 1 LIMIT 1