sigo/app/views/logistics/sectors/_table.haml

SELECT `sectors`.* FROM `sectors`
---
                %ul
                  - Sector.getSubSectors(sector.code).each do |subsector|