tobi/app/views/management/budgets/_table.haml

SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`budget_id` = 1
---
            %tbody
              - item.valorizations.each do |valorization|