tobi/app/views/management/budgets/get_budget_by_project.haml

            %tr
              -if (budget.cod_budget.length > 7)
---
SELECT `budgets`.* FROM `budgets` WHERE (type_of_budget = '0' AND cost_center_id = '2' )