sigo/app/views/logistics/articles/_form.haml

  function complete_infocombo(url, category_code, form_token, default_value){
    $.ajax({
        type: "POST",
        url: url,
        async: false,
        data: { category_code: category_code, authenticity_token: form_token}
      }).done(function( data ) {
        newOptions = [];
        $.each(data.subcategories, function(key, value){
          item = {};
          item['name'] = value.name;
          item['code'] = value.code;
          item['id'] = value.id;
          newOptions.push(item);
        });
        $('#subcategory-select').empty();
        $('#subcategory-select').append(
              $("<option></option>").attr("value", "").text("Seleccione un Subgrupo")
            )
        $('#specific-select').empty();
        $('#specific-select').append(
              $("<option></option>").attr("value", "").text("Seleccione un Específico")
---
SELECT `categories`.* FROM `categories`