sigo/app/controllers/logistics/articles_controller.rb

  def index
    flash[:error] = nil
    #@Article = Article.order("id DESC").group("name")
    @Article = Article.order("id DESC")
    @unitOfMeasurement = UnitOfMeasurement.first
    @group = Category.first
    @subgroup = Subcategory.first
    @typeOfArticle = TypeOfArticle.first
---
SELECT `articles`.* FROM `articles` ORDER BY id DESC
SELECT `unit_of_measurements`.* FROM `unit_of_measurements` ORDER BY `unit_of_measurements`.`id` ASC LIMIT 1
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC LIMIT 1
SELECT `subcategories`.* FROM `subcategories` ORDER BY `subcategories`.`id` ASC LIMIT 1
SELECT `type_of_articles`.* FROM `type_of_articles` ORDER BY `type_of_articles`.`id` ASC LIMIT 1

  def create
    flash[:error] = nil
    article = Article.new(article_parameters)
    article.code = params[:extrafield]['first_code'].to_s + params[:article]['code'].to_s
    if article.save
---
INSERT INTO `articles` (`category_id`, `code`, `created_at`, `description`, `name`, `type_of_article_id`, `updated_at`) VALUES (1, '02010409', '2014-03-11 20:44:39', 'Lorem Ipsum.', 'Articulo Random', 2, '2014-03-11 20:44:39')

  def new
    @article = Article.new
    @specifics = Specific.all
    @categories = Category.all
    @unitOfMeasurement = UnitOfMeasurement.all
    @typeOfArticles = TypeOfArticle.all
---
SELECT `categories`.* FROM `categories`
SELECT `unit_of_measurements`.* FROM `unit_of_measurements`
SELECT `type_of_articles`.* FROM `type_of_articles`