sigo/app/controllers/logistics/categories_controller.rb

  def create
    flash[:error] = nil
    category = Category.new(category_parameters)
    category.code = params[:extrafield]['first_code'].to_s + params[:category]['code'].to_s
    if category.save
---
INSERT INTO `categories` (`code`, `created_at`, `name`, `updated_at`) VALUES ('01', '2014-03-11 16:15:53', 'Grupo 1', '2014-03-11 16:15:53')