sigo/app/controllers/logistics/center_of_attentions_controller.rb

  def index
    flash[:error] = nil
    @centerOfAttention = CenterOfAttention.all
---
SELECT `center_of_attentions`.* FROM `center_of_attentions`

  def create
    centerOfAttention = CenterOfAttention.new(center_of_attentions_parameters)
    if centerOfAttention.save
---
INSERT INTO `center_of_attentions` (`created_at`, `name`, `updated_at`) VALUES ('2014-03-11 16:15:20', 'Centro de Atención 1', '2014-03-11 16:15:20')

  def edit
    @centerOfAttention = CenterOfAttention.find(params[:id])
---
SELECT `center_of_attentions`.* FROM `center_of_attentions` WHERE `center_of_attentions`.`id` = 1 LIMIT 1

  def update
    centerOfAttention = CenterOfAttention.find(params[:id])
---
SELECT `center_of_attentions`.* FROM `center_of_attentions` WHERE `center_of_attentions`.`id` = 1 LIMIT 1