sigo/app/controllers/logistics/cost_centers_controller.rb

SELECT `cost_centers`.* FROM `cost_centers`
---
  def index
    flash[:error] = nil
    @company = get_company_cost_center('company')
    #@own_cost_center = current_user.cost_centers
    @costCenters = CostCenter.all

INSERT INTO `cost_centers` (`code`, `created_at`, `name`, `updated_at`) VALUES ('01', '2014-03-11 16:15:38', 'Centro de Costo 1', '2014-03-11 16:15:38')
---
  def create
    flash[:error] = nil
    costCenter = CostCenter.new(cost_center_parameters)
    if costCenter.save