sigo/app/controllers/logistics/delivery_orders_controller.rb

  def index
    @article = Article.first
    @phase = Phase.first
    @sector = Sector.first
    @costcenters = CostCenter.where("company_id = #{params[:company_id]}")
    @centerOfAttention = CenterOfAttention.all.first
---
SELECT `articles`.* FROM `articles` ORDER BY `articles`.`id` ASC LIMIT 1
SELECT `phases`.* FROM `phases` ORDER BY `phases`.`id` ASC LIMIT 1
SELECT `sectors`.* FROM `sectors` ORDER BY `sectors`.`id` ASC LIMIT 1
SELECT `center_of_attentions`.* FROM `center_of_attentions` ORDER BY `center_of_attentions`.`id` ASC LIMIT 1

  def new
    @company = params[:company_id]
    @cost_center = CostCenter.find(params[:cost_center_id])
    @deliveryOrder = DeliveryOrder.new
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def create
    deliveryOrder = DeliveryOrder.new(delivery_order_parameters)
    deliveryOrder.state
    deliveryOrder.user_id = current_user.id
    if deliveryOrder.save
---
INSERT INTO `delivery_orders` (`created_at`, `date_of_issue`, `description`, `scheduled`, `state`, `updated_at`, `user_id`) VALUES ('2014-03-11 16:49:13', '2014-03-12', 'Lorem Ipsum Dolor Sit amet', '2014-03-19', 'pre_issued', '2014-03-11 16:49:13', 1)

  def show
    @company = params[:company_id]
    @deliveryOrder = DeliveryOrder.find(params[:id])
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 1 LIMIT 1

  def edit
    @company = params[:company_id]
    @deliveryOrder = DeliveryOrder.find(params[:id])
    @articles = Article.all
    @sectors = Sector.all
    @phases = Phase.where("category LIKE 'phase'")
    @centerOfAttentions = CenterOfAttention.all
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 2 LIMIT 1
SELECT `articles`.* FROM `articles`
SELECT `sectors`.* FROM `sectors`
SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')
SELECT `center_of_attentions`.* FROM `center_of_attentions`

  def add_delivery_order_item_field
    @reg_n = Time.now.to_i
    data_article_unit = params[:article_id].split('-')
    @article = Article.find(data_article_unit[0])
    @sectors = Sector.all
    @phases = Phase.where("category LIKE 'phase'")
    @amount = params[:amount].to_f
    @centerOfAttention = CenterOfAttention.all
    @code_article, @name_article, @id_article = @article.code, @article.name, @article.id
    @unitOfMeasurement = UnitOfMeasurement.find(data_article_unit[1]).symbol
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 2 LIMIT 1
SELECT `sectors`.* FROM `sectors`
SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')
SELECT `center_of_attentions`.* FROM `center_of_attentions`
SELECT `unit_of_measurements`.* FROM `unit_of_measurements` WHERE `unit_of_measurements`.`id` = 1 LIMIT 1

  def destroy
    @deliveryOrder = DeliveryOrder.find_by_id(params[:id])
    @deliveryOrder.cancel
    stateOrderDetail = StatePerOrderDetail.new
    stateOrderDetail.state = @deliveryOrder.human_state_name
    stateOrderDetail.delivery_order_id = params[:id]
    stateOrderDetail.user_id = current_user.id
    stateOrderDetail.save
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 1 LIMIT 1
INSERT INTO `state_per_order_details` (`created_at`, `delivery_order_id`, `state`, `updated_at`) VALUES ('2014-03-11 16:55:20', 1, 'canceled', '2014-03-11 16:55:20')

  def goissue
    @deliveryOrder = DeliveryOrder.find_by_id(params[:id])
    @deliveryOrder.issue
    stateOrderDetail = StatePerOrderDetail.new
    stateOrderDetail.state = @deliveryOrder.human_state_name
    stateOrderDetail.delivery_order_id = params[:id]
    stateOrderDetail.user_id = current_user.id
    stateOrderDetail.save
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 1 LIMIT 1
INSERT INTO `state_per_order_details` (`created_at`, `delivery_order_id`, `state`, `updated_at`, `user_id`) VALUES ('2014-03-11 23:12:00', 2, 'issued', '2014-03-11 23:12:00', 1)

  def gorevise
    @deliveryOrder = DeliveryOrder.find_by_id(params[:id])
    @deliveryOrder.revise
    stateOrderDetail = StatePerOrderDetail.new
    stateOrderDetail.state = @deliveryOrder.human_state_name
    stateOrderDetail.delivery_order_id = params[:id]
    stateOrderDetail.user_id = current_user.id
    stateOrderDetail.save
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 1 LIMIT 1
INSERT INTO `state_per_order_details` (`created_at`, `delivery_order_id`, `state`, `updated_at`, `user_id`) VALUES ('2014-03-11 23:12:05', 2, 'revised', '2014-03-11 23:12:05', 1)

  def goapprove
    @deliveryOrder = DeliveryOrder.find_by_id(params[:id])
    @deliveryOrder.approve
    stateOrderDetail = StatePerOrderDetail.new
    stateOrderDetail.state = @deliveryOrder.human_state_name
    stateOrderDetail.delivery_order_id = params[:id]
    stateOrderDetail.user_id = current_user.id
    stateOrderDetail.save
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 2 LIMIT 1
INSERT INTO `state_per_order_details` (`created_at`, `delivery_order_id`, `state`, `updated_at`, `user_id`) VALUES ('2014-03-11 23:12:09', 2, 'approved', '2014-03-11 23:12:09', 1)

  def delivery_order_pdf
    @company = Company.find(params[:company_id])
    @deliveryOrder = DeliveryOrder.find(params[:id])
    @deliveryOrderDetails = @deliveryOrder.delivery_order_details

    if @deliveryOrder.state == 'pre_issued'
      @state_per_order_details_approved = @deliveryOrder.state_per_order_details.where("state LIKE 'pre_issued'").last
---
SELECT `delivery_orders`.* FROM `delivery_orders` WHERE `delivery_orders`.`id` = 2 LIMIT 1
SELECT `delivery_order_details`.* FROM `delivery_order_details` WHERE `delivery_order_details`.`delivery_order_id` = 2
SELECT `state_per_order_details`.* FROM `state_per_order_details` WHERE `state_per_order_details`.`delivery_order_id` = 2 AND (state LIKE 'approved') ORDER BY `state_per_order_details`.`id` DESC LIMIT 1