sigo/app/controllers/logistics/delivery_orders_controller.rb

SELECT `delivery_orders`.* FROM `delivery_orders` WHERE (user_id = '1')
---
  def index
    @article = Article.first
    @phase = Phase.first
    @sector = Sector.first
    @company = get_company_cost_center('company')
    @cost_center = get_company_cost_center('cost_center')
    @deliveryOrders = DeliveryOrder.where("cost_center_id = ?",@cost_center)