sigo/app/controllers/logistics/persons_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `first_name` = 'Lorem', `last_name` = 'Ipsum ', `surname` = 'Dolor sit amer', `date_of_birth` = '1992-08-19', `avatar_file_name` = 'perfil.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 174445, `avatar_updated_at` = '2014-03-11 16:09:07', `updated_at` = '2014-03-11 16:09:08' WHERE `users`.`id` = 1
---
  def update
    @person = User.find(params[:id])
    @person.roles = [params[:role]]
    @person.update_attributes(user_params)