sigo/app/controllers/logistics/phases_controller.rb

  def index
    flash[:error] = nil
    @company = Company.find(get_company_cost_center("company"))
    @phases = Phase.where("category LIKE 'phase'")
---
SELECT `phases`.* FROM `phases` WHERE (code LIKE '01%' AND category = 'subphase')

  def create
    flash[:error] = nil
    phase = Phase.new(phase_parameters)
    if phase.category == "subphase"
      phase.code = params[:extrafield]['first_code'].to_s + params[:phase]['code'].to_s
    end
    if phase.save
---
INSERT INTO `phases` (`category`, `code`, `created_at`, `name`, `updated_at`) VALUES ('phase', '01', '2014-03-11 16:40:19', 'Fase 1', '2014-03-11 16:40:19')