sigo/app/controllers/logistics/sectors_controller.rb

  def create
    if params[:is]== nil
      sector = Sector.new(sector_parameters)
    else
      sector = Sector.new
      sector.code = params[:extrafield]['first_code'].to_s + params[:sector]['code'].to_s
      sector.name = params[:sector]['name'].to_s
    end
    sector.cost_center_id = get_company_cost_center('cost_center')
    if sector.save
---
INSERT INTO `sectors` (`created_at`, `name`, `updated_at`) VALUES ('2014-03-11 16:34:55', 'Sector 1', '2014-03-11 16:34:55')