sigo/app/controllers/logistics/subphases_controller.rb

SELECT `phases`.* FROM `phases` WHERE `phases`.`category` = 'phase'
---
  def new
    @subphase = Phase.new
    @phases = Phase.all.where(category: 'phase')