sigo/app/controllers/logistics/type_of_articles_controller.rb

SELECT `type_of_articles`.* FROM `type_of_articles`
---
  def index
    flash[:error] = nil
    @typeOfArticles = TypeOfArticle.all

INSERT INTO `type_of_articles` (`code`, `created_at`, `name`, `updated_at`) VALUES ('01', '2014-03-11 16:34:13', 'Tipo de Insumo 1', '2014-03-11 16:34:13')
---
  def create
    flash[:error] = nil
    typeOfArticle = TypeOfArticle.new(type_of_article_parameters)
    if typeOfArticle.save