sigo/app/controllers/logistics/unit_of_measurements_controller.rb

  def index
    flash[:error] = nil
    @unitOfMeasures = UnitOfMeasurement.all
---
SELECT `unit_of_measurements`.* FROM `unit_of_measurements`

  def create
    flash[:error] = nil
    unitOfMeasure = UnitOfMeasurement.new(unit_of_measure_parameters)
    if unitOfMeasure.save
---
INSERT INTO `unit_of_measurements` (`code`, `created_at`, `name`, `symbol`, `updated_at`) VALUES ('01', '2014-03-11 16:14:46', 'Bolsas', 'BS', '2014-03-11 16:14:46')