tobi/app/controllers/management/budgets_controller.rb

SELECT `budgets`.* FROM `budgets`
---
  def index
  	@budgets_goal = Budget.where(:type_of_budget => '0')
  	@budgets_sale = Budget.where(:type_of_budget => '1')
    respond_to do |format|
      format.json { render :json => Budget.all.to_json }

SELECT `budgets`.* FROM `budgets` WHERE (type_of_budget = '0' AND cost_center_id = '2' )
---
  def get_budget_by_project
    @project_id = params[:project_id]
    @budgets_goal = Budget.where("type_of_budget = ? AND cost_center_id = ? ", '0', @project_id)

SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1
---
  def edit
    @budget = Budget.find(params[:id])

SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1
---
  def resume
    @budget = Budget.find(params[:id])