tobi/app/controllers/management/cost_centers_controller.rb

INSERT INTO `cost_centers` (`created_at`, `name`, `status`, `updated_at`) VALUES ('2014-06-04 20:17:27', 'NOmbre RAndom', 'A', '2014-06-04 20:17:27')
INSERT INTO `wbsitems` (`codewbs`, `cost_center_id`, `created_at`, `name`, `updated_at`) VALUES (5, 5, '2014-06-04 20:17:27', 'NOmbre RAndom', '2014-06-04 20:17:27')
---
  def create
  	costcenter = CostCenter.new(cost_center_parameters)
    wbsitem = Wbsitem.new

  	#if project.save
  	costcenter.save
    wbsitem.codewbs = costcenter.id
    wbsitem.name = costcenter.name
    wbsitem.cost_center_id = costcenter.id
    wbsitem.save