tobi/app/controllers/management/dashboard_controller.rb

  def index
    @user = current_manager
    #if @user == nil
    #  redirect_to :controller => "management/budgets", :action => :administrate_budget
    #end

    #@type_user = @user.kind

  	project_id = params['project']
  	@project_selected = CostCenter.find(project_id).to_json

  	@project = CostCenter.find(project_id)

  	@budget_sale = Budget.where("`type_of_budget` = 1 AND `subbudget_code` IS NOT NULL AND `cost_center_id` = (?)", project_id).first.id rescue nil
---
SELECT `budgets`.* FROM `budgets` WHERE (`type_of_budget` = 1 AND `subbudget_code` IS NOT NULL AND `cost_center_id` = ('2')) ORDER BY `budgets`.`id` ASC LIMIT 1