tobi/app/controllers/management/extensionscontrols_controller.rb

SELECT `extensionscontrols`.* FROM `extensionscontrols` WHERE `extensionscontrols`.`cost_center_id` IS NULL
---
  def index
    @extensionscontrol = Extensionscontrol.where(:cost_center_id => params[:project_id])

INSERT INTO `extensionscontrols` (`approved_deadline`, `approved_mgg`, `cost_center_id`, `created_at`, `motive`, `observation`, `requested_deadline`, `requested_mgg`, `resolution`, `status`, `updated_at`) VALUES (1.0, 2.0, 2, '2014-06-05 21:43:48', 'No sé', '', 1.0, 2.0, '11', 'requested', '2014-06-05 21:43:48')
---
  def create
    extensionscontrol = Extensionscontrol.new(extensions_parameters)
    @project_id = params[:project_id]
    extensionscontrol.status
    extensionscontrol.cost_center_id = @project_id
    extensionscontrol.save