tobi/app/controllers/management/inputbybudgetanditems_controller.rb

  def filter_by_budget_and_item
  	@item_id = params[:item_id]
  	@budget_id = params[:budget_id]
    @budget = Budget.find(@budget_id)
    @order = params[:order].gsub("d",".")

    @pdf_table_array = Array.new

  	@itembybudgetanditems = Inputbybudgetanditem.select("id, cod_input, sum(quantity) as quantity, price, input, unit").where("budget_id = ? AND inputbybudgetanditems.order LIKE ?", params[:budget_id],  @order + "%").group(' cod_input, price, input, unit').order(:cod_input)
---
SELECT SUM(quantity * price) AS sum_id FROM `inputbybudgetanditems` WHERE (cod_input LIKE '01%' AND budget_id = '7' AND inputbybudgetanditems.order LIKE '01.01%')
SELECT cod_input, sum(quantity) as quantity, price, input, unit FROM `inputbybudgetanditems` WHERE (budget_id = '7' AND inputbybudgetanditems.order LIKE '01.01%') GROUP BY cod_input, price, input, unit ORDER BY `inputbybudgetanditems`.cod_input ASC