tobi/app/controllers/management/itembywbses_controller.rb

  def add_data_item

    @wbs = params[:wbscode]

    temp_wbs = Wbsitem.where(:codewbs => params[:wbscode].to_s).first
    budget = Budget.find(params[:budget_id])
    item = Item.where(:item_code => params[:item_code]).first
    order = (params[:order].to_s).gsub('a', '.')

    str_name  = (CGI.unescape(params[:subbudgetdetail])).to_s.gsub('_', '\'')

    new_item = Itembywbs.where("budget_id = ? AND itembybudget_id = ? AND wbscode = ? AND order_budget = ?", params[:budget_id],  params[:id], params[:wbscode].to_s,  order).first


    item_by_budget = Itembybudget.find(params[:id])
---
SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`codewbs` = '21' ORDER BY `wbsitems`.`id` ASC LIMIT 1
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 7 ORDER BY `budgets`.`id` ASC LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`item_code` = '010009180580' ORDER BY `items`.`id` ASC LIMIT 1
SELECT `itembybudgets`.* FROM `itembybudgets` WHERE `itembybudgets`.`id` = 4066 LIMIT 1

    end

    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)
    @budgets = Budget.where(:cost_center_id => params[:project_id])
    @wbsitems_arr = Array.new
    @budgets.each do |budget|
      temp_wbsitems = budget.itembywbses
      temp_wbsitems.each do |item|
---
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`cost_center_id` = 2
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`project_id` = '2'
SELECT `itembywbses`.* FROM `itembywbses` WHERE (budget_id = '7' AND itembybudget_id = '4066' AND wbscode = '21' AND order_budget = '01.02') ORDER BY `itembywbses`.`id` ASC LIMIT 1