tobi/app/controllers/management/itembybudgets_controller.rb

  def filter_by_budget
    #@total_budget = Itembybudget.where(:budget_id => params[:budget_id]).sum()
    @budget_id = params[:budget_id]
  	@itembybudgets = Itembybudget.where(:budget_id=>params[:budget_id])
---
SELECT `itembybudgets`.* FROM `itembybudgets` WHERE `itembybudgets`.`budget_id` = 7