tobi/app/controllers/management/valorizations_controller.rb

SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`project_id` IS NULL
---
  def index
    @budgets=Budget.where(:project_id => params[:project_id])