tobi/app/controllers/management/valorizationitems_controller.rb

SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 LIMIT 1
SELECT `itembybudgets`.* FROM `itembybudgets` WHERE `itembybudgets`.`id` = 5 LIMIT 1
SELECT `valorizationitems`.* FROM `valorizationitems` WHERE (valorization_id = 1 AND itembybudget_id = 5) ORDER BY `valorizationitems`.`id` ASC LIMIT 1
INSERT INTO `valorizationitems` (`actual_measured`, `created_at`, `itembybudget_id`, `updated_at`, `valorization_id`) VALUES (20.0, '2014-06-05 20:11:47', 5, '2014-06-05 20:11:47', 1)
---
	def update_valorization_item
		valorization = Valorization.find(params[:id])

		measured_param = params[:measured]

		item = Itembybudget.find(params[:item])

		valorization_item = Valorizationitem.where("valorization_id = ? AND itembybudget_id = ?", valorization.id, item.id).first

		if valorization_item != nil
			valorization_item.actual_measured = measured_param
			valorization_item.save
		else
			new_valorization_item = Valorizationitem.new
			new_valorization_item.valorization_id = valorization.id
			new_valorization_item.itembybudget_id = item.id
			new_valorization_item.actual_measured = measured_param
			new_valorization_item.save