tobi/app/controllers/management/valorizations_controller.rb

  def index
    @budgets=Budget.where(:cost_center_id => params[:project_id])
---
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`cost_center_id` = 2

  def newvalorization
    @itembybudgets = Itembybudget.all
    @budget = Budget.find(params[:id])
---
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1

  def changevalorization
  	@itembybudgets = Itembybudget.all
    @valorization = Valorization.find(params[:id])
    @budget = Budget.where(:id => @valorization.budget_id).first
---
SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 LIMIT 1
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 ORDER BY `budgets`.`id` ASC LIMIT 1

  def create
    valorization = Valorization.new(valorization_parameters)
    valorization.month = "Valorizacion : " + valorization.valorization_date.strftime("%B %Y")
    valorization.save

    cost_center_id = Budget.find(valorization.budget_id).cost_center_id
---
INSERT INTO `valorizations` (`budget_id`, `created_at`, `month`, `status`, `updated_at`, `valorization_date`) VALUES (1, '2014-06-05 18:40:52', 'Valorizacion : June 2014', 'pending', '2014-06-05 18:40:52', '2014-06-01')
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 2 LIMIT 1

  def finalize
    @valorization = Valorization.find(params[:id])
    @valorization.complete!

    cost_center_id = Budget.find(@valorization.budget_id).cost_center_id
---
SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 LIMIT 1
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 LIMIT 1

  def show_data
    @valorization = Valorization.find(params[:id])
---
SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 LIMIT 1

  def report
    @itembybudgets = Itembybudget.all
    @valorization = Valorization.find(params[:id])
    @budget = Budget.where(:id => @valorization.budget_id).first

    @valorizationitem = Valorizationitem.where(:valorization_id => @valorization.id)

    @project = CostCenter.find(@budget.cost_center_id)

    @itembybudgets_main = Itembybudget.select('id, `title`, `order`, CHAR_LENGTH(`order`)').where('CHAR_LENGTH(`order`) < 3')
---
SELECT `valorizations`.* FROM `valorizations` WHERE `valorizations`.`id` = 1 LIMIT 1
SELECT `budgets`.* FROM `budgets` WHERE `budgets`.`id` = 1 ORDER BY `budgets`.`id` ASC LIMIT 1
SELECT SUM(measured * price) AS sum_id FROM `itembybudgets` WHERE (`order` LIKE ('01%') AND budget_id = (1) AND measured > 0)
SELECT id, `title`, `order`, CHAR_LENGTH(`order`) FROM `itembybudgets` WHERE (CHAR_LENGTH(`order`) < 3)