tobi/app/controllers/management/wbsitems_controller.rb

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`codewbs` = '11' ORDER BY `wbsitems`.`id` ASC LIMIT 1
---
  def index
  	@wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)

SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs = '2' ) ORDER BY `wbsitems`.`id` ASC LIMIT 1
SELECT `itembywbses`.* FROM `itembywbses` WHERE `itembywbses`.`wbsitem_id` = 1
---
  def show_measured
    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)
    @itembywbses = Array.new
    @wbsitems.each do |item|
      item.itembywbses.each do |i|

SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs LIKE '5%') ORDER BY `wbsitems`.codewbs ASC
---
  def new
  	@wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`id` = 5 LIMIT 1
UPDATE `wbsitems` SET `name` = 'Item2Ola', `description` = 'funciona?', `notes` = 'si funciona!', `updated_at` = '2014-06-04 20:36:36' WHERE `wbsitems`.`id` = 5
---
  def update
    @wbsitem = Wbsitem.find(params[:id])
    @wbsitem.update_attributes(wbsitem_parameters)

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`id` = 5 LIMIT 1
---
  def edit
    @wbsitem = Wbsitem.find(params[:id])

SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs LIKE '2%') ORDER BY `wbsitems`.codewbs ASC
SELECT `phases`.* FROM `phases`
---
  def get_items_from_project
    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)
    @data = Phase.all

SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs = '2') ORDER BY `wbsitems`.`id` ASC LIMIT 1
SELECT `wbsitems`.* FROM `wbsitems` ORDER BY `wbsitems`.codewbs ASC
DELETE FROM `wbsitems` WHERE `wbsitems`.`id` = 6
---
  def destroy

    wbsitem = Wbsitem.find(params[:id])
    wbsitemchilds = Wbsitem.where("codewbs LIKE ?", wbsitem.codewbs + "%")
    code = wbsitem.codewbs

    c=code.length-1

    parent_item = Wbsitem.where("codewbs = ?", code.to_s[0..c-1]).first

    #delete childs
    wbsitemchilds.each do |wbs_item|
      wbs_item.destroy

SELECT `phases`.* FROM `phases`
---
    end

    @wbsitems = Wbsitem.order(:codewbs)
    @data = Phase.all

SELECT `wbsitems`.* FROM `wbsitems` WHERE (codewbs LIKE '2%') ORDER BY `wbsitems`.codewbs ASC
SELECT `budgets`.* FROM `budgets` WHERE (cost_center_id = '2' AND type_of_budget = '1')
SELECT `itembywbses`.* FROM `itembywbses` WHERE `itembywbses`.`budget_id` = 7
---
  def add_items_to_wbs

  	@wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)

  	@budgets = Budget.where("cost_center_id = ? AND type_of_budget = ?", params[:project_id], params[:type_budget])
  	@wbsitems_arr = Array.new
  	@budgets.each do |budget|
  		temp_wbsitems = budget.itembywbses
  		temp_wbsitems.each do |item|

SELECT `itembybudgets`.* FROM `itembybudgets` WHERE `itembybudgets`.`budget_id` = 7
---
  def get_items_by_budget
  	@items = Itembybudget.where(:budget_id => params[:budget_id].to_s)

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`id` = 3 LIMIT 1
INSERT INTO `wbsitems` (`codewbs`, `cost_center_id`, `created_at`, `description`, `name`, `notes`, `updated_at`) VALUES ('51', 5, '2014-06-04 20:17:44', '', 'onol', '', '2014-06-04 20:17:44')
---
  def create
  	if (params[:major_item]!=nil)
	  	wbsitem_selected = Wbsitem.find(params[:major_item])

	  	last_id = Wbsitem.find(:all, :conditions=>["codewbs like ?", wbsitem_selected.codewbs + "_"]).count
	  	last_id_total = Wbsitem.find(:all, :conditions=>["codewbs like ?", wbsitem_selected.codewbs + "%"]).count

	  	wbsitem = Wbsitem.new(wbsitem_parameters)
	  	if last_id_total.to_s == "0"
	  		wbsitem.codewbs = wbsitem_selected.codewbs + (last_id).to_s
	  	else
	  		wbsitem.codewbs = wbsitem_selected.codewbs + (last_id+1).to_s
	  	end
  	else
  		wbsitem = Wbsitem.new(wbsitem_parameters)
  		wbsitem.codewbs=params[:wbsitem][:project_id];
  	end
  	wbsitem.save

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`codewbs` = '21' ORDER BY `wbsitems`.`id` ASC LIMIT 1
---
  def set_gantt
    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)

SELECT `itembywbses`.* FROM `itembywbses` WHERE `itembywbses`.`wbsitem_id` = 1
---
  def showbymonth_gantt
    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)
    @itembywbses = Array.new
    @wbsitems.each do |item|
      item.itembywbses.each do |i|

SELECT `wbsitems`.* FROM `wbsitems` WHERE `wbsitems`.`id` = 5 LIMIT 1
SELECT `phases`.* FROM `phases` WHERE `phases`.`code` = 104 ORDER BY `phases`.`id` ASC LIMIT 1
UPDATE `wbsitems` SET `fase` = '0104 Sub Fase 1.1', `phase_id` = 4, `updated_at` = '2014-06-04 21:11:44' WHERE `wbsitems`.`id` = 5
---
  def add_phases_to_item
    wbsitem_id = params[:wbsitem_id]
    @phase = params[:phase_id]
    @wbsitem = Wbsitem.find(wbsitem_id)
    @wbsitem.fase = @phase
    @wbsitem.phase_id = Phase.where(code: ((@phase.split(' '))[0]).to_i).first.id
    @wbsitem.save

SELECT `itembywbses`.* FROM `itembywbses` WHERE `itembywbses`.`wbsitem_id` = 1
---
  def showperitem_gantt
    @wbsitems = Wbsitem.where("codewbs LIKE ?", params[:project_id].to_s + "%").order(:codewbs)
    @itembywbses = Array.new
    @wbsitems.each do |item|
      item.itembywbses.each do |i|